{
  "_name_or_path": "cse291-pa3-98b-llama-budget-model",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "bos_token_id": 128000,
  "eos_token_id": 128001,
  "hidden_act": "silu",
  "hidden_size": 8192,
  "initializer_range": 0.02,
  "intermediate_size": 28672,
  "max_position_embeddings": 8192,
  "model_type": "llama",
  "num_attention_heads": 64,
  "num_hidden_layers": 112,
  "num_key_value_heads": 8,
  "rms_norm_eps": 1e-05,
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.0",
  "use_cache": true,
  "vocab_size": 128256,
  "training_budget_usd": 5000000,
  "selected_gpu": "B200",
  "training_budget_flops": 2.7e24,
  "optimal_parameter_count": 9.781e10,
  "estimated_parameter_count": 97934647296,
  "training_tokens": 4.601e12,
  "description": "Dense Llama-style model chosen to match the $5M scaling-law optimum. With hidden_size=8192, intermediate_size=28672, 112 layers, GQA with 64 query heads and 8 KV heads, and untied embeddings, the Part 2.1 parameter formula gives 97,934,647,296 parameters, within about 0.1% of the computed optimum N≈9.781e10."
}
