{
  "architectures": ["MoEForCausalLM"],
  "model_type": "moe_transformer",
  "hidden_size": 4096,
  "intermediate_size": 13824,
  "num_attention_heads": 32,
  "num_key_value_heads": 8,
  "num_hidden_layers": 32,
  "num_experts": 128,
  "num_experts_per_token": 2,
  "max_position_embeddings": 8192,
  "vocab_size": 128256,
  "torch_dtype": "bfloat16",
  "total_parameters": 37000000000,
  "activated_parameters_per_token": 9250000000,
  "training_tokens": 100000000000,
  "training_budget_usd": 5000000,
  "description": "Efficient 37B MoE designed for $5M training budget. Achieves N≈9.78e10 tokens, D≈4.60e12 FLOPs via sparse expert routing (top-2). Chosen for high per-token capacity (9.25B activated params) with minimal communication overhead. B200 GPU selected for 2250 TFLOPs @ $6/hour."
}
